tutorials/LaserInducedForwardTransform/Mahravan_Kim/2D/constant/thermophysicalProperties.air

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState adiabaticPerfectFluid;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   29.466;
    }
    thermodynamics
    {
        Cp          1864;
        Hf          0;
    }
    equationOfState
    {
        rho0       1.08616075109;
        B          0;
        gamma      1.45;
        p0         117251;
    }
    transport
    {
        mu          1.84e-5;
        Pr          0.7;
    }
}


// ************************************************************************* //
